/**
 *
 */

#include <linux/module.h>       /* Needed by all modules */
#include <linux/kernel.h>       /* Needed for KERN_INFO */
#include <linux/init.h>         /* Needed for the macros */
#include <linux/fs.h>           /* Needed for files operations */
#include <linux/pci.h>          /* Needed for PCI */
#include <asm/uaccess.h>        /* Needed for copy_to_user & copy_from_user */
#include <linux/delay.h>        /* udelay, mdelay */
#include <linux/dma-mapping.h>
#include <linux/fs.h>
#include <linux/cdev.h>
#include "xpdma_driver.h"

MODULE_LICENSE("Dual BSD/GPL");
MODULE_DESCRIPTION("PCIe driver for Xilinx CDMA subsystem (XAPP1171), Linux");
MODULE_AUTHOR("Strezhik Iurii");

// Max CDMA buffer size
#define MAX_BTT             0x007FFFFF   // 8 MBytes maximum for DMA Transfer */
#define BUF_SIZE            (4<<20)      // 4 MBytes read/write buffer size
#define TRANSFER_SIZE       (4<<20)      // 4 MBytes transfer size for scatter gather
#define DESCRIPTOR_SIZE     64           // 64-byte aligned Transfer Descriptor

#define BRAM_OFFSET         0x00000000   // Translation BRAM offset
#define PCIE_CTL_OFFSET     0x00008000   // AXI PCIe control offset
#define CDMA_OFFSET         0x0000c000   // AXI CDMA LITE control offset

// AXI CDMA Register Offsets
#define CDMA_CONTROL_OFFSET 0x00         // Control Register
#define CDMA_STATUS_OFFSET  0x04         // Status Register
#define CDMA_CDESC_OFFSET   0x08         // Current descriptor Register
#define CDMA_TDESC_OFFSET   0x10         // Tail descriptor Register
#define CDMA_SRCADDR_OFFSET 0x18         // Source Address Register
#define CDMA_DSTADDR_OFFSET 0x20         // Dest Address Register
#define CDMA_BTT_OFFSET     0x28         // Bytes to transfer Register

#define AXI_PCIE_DM_ADDR    0x80000000   // AXI:BAR1 Address
#define AXI_PCIE_SG_ADDR    0x80800000   // AXI:BAR0 Address
#define AXI_BRAM_ADDR       0x81000000   // AXI Translation BRAM Address
#define AXI_DDR3_ADDR       0x00000000   // AXI DDR3 Address

#define SG_COMPLETE_MASK    0xF0000000   // Scatter Gather Operation Complete status flag mask
#define SG_DEC_ERR_MASK     0x40000000   // Scatter Gather Operation Decode Error flag mask
#define SG_SLAVE_ERR_MASK   0x20000000   // Scatter Gather Operation Slave Error flag mask
#define SG_INT_ERR_MASK     0x10000000   // Scatter Gather Operation Internal Error flag mask

#define BRAM_STEP           0x8          // Translation Vector Length
#define ADDR_BTT            0x00000008   // 64 bit address translation descriptor control length

#define CDMA_CR_SG_EN       0x00000008   // Scatter gather mode enable
#define CDMA_CR_IDLE_MASK   0x00000002   // CDMA Idle mask
#define CDMA_CR_RESET_MASK  0x00000004   // CDMA Reset mask
#define AXIBAR2PCIEBAR_0U   0x208        // AXI:BAR0 Upper Address Translation (bits [63:32])
#define AXIBAR2PCIEBAR_0L   0x20C        // AXI:BAR0 Lower Address Translation (bits [31:0])
#define AXIBAR2PCIEBAR_1U   0x210        // AXI:BAR1 Upper Address Translation (bits [63:32])
#define AXIBAR2PCIEBAR_1L   0x214        // AXI:BAR1 Lower Address Translation (bits [31:0])

#define CDMA_RESET_LOOP	    1000000      // Reset timeout counter limit
#define SG_TRANSFER_LOOP    1000000      // Scatter Gather Transfer timeout counter limit

// Scatter Gather Transfer descriptor
typedef struct {
    u32 nextDesc;   /* 0x00 */
    u32 na1;	    /* 0x04 */
    u32 srcAddr;    /* 0x08 */
    u32 na2;        /* 0x0C */
    u32 destAddr;   /* 0x10 */
    u32 na3;        /* 0x14 */
    u32 control;    /* 0x18 */
    u32 status;     /* 0x1C */
} __aligned(DESCRIPTOR_SIZE) sg_desc_t;

#define HAVE_KERNEL_REG     0x01    // Kernel registration
#define HAVE_MEM_REGION     0x02    // I/O Memory region

int gDrvrMajor = 241;               // Major number not dynamic
int gKernelRegFlag = 0;


static dev_t first;         // Global variable for the first device number
static struct cdev c_dev;     // Global variable for the character device structure
static struct class *cl;     // Global variable for the device class

//semaphores
static struct semaphore gSemDma;

struct xpdma_state {
    struct pci_dev *dev;
    bool used;
    unsigned int statFlags /*= 0x00*/; // Status flags used for cleanup
    unsigned long baseHdwr;        // Base register address (Hardware address) 
    unsigned long baseLen;         // Base register address Length
    void *baseVirt /*= NULL*/;         // Base register address (Virtual address, for I/O)
